In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
sns.set()

- Chargement du Dataset

In [22]:
df = pd.read_csv('tested.csv')

- Affichage des 5 Prémiere ligne du Dataset

In [23]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

- Taille de Dataset

In [24]:
df.shape

(418, 12)

- Liste des Colonne du Data set

In [25]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

- Suppression des variable unitile pour notre étude

In [26]:
df = df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Fare','Cabin','Embarked'],axis=1)

In [27]:
df.head()

   Survived  Pclass     Sex   Age
0         0       3    male  34.5
1         1       3  female  47.0
2         0       2    male  62.0
3         0       3    male  27.0
4         1       3  female  22.0

- Desceiption des données avec la fonction describe

In [29]:
df.describe()

         Survived      Pclass         Age
count  418.000000  418.000000  332.000000
mean     0.363636    2.265550   30.272590
std      0.481622    0.841838   14.181209
min      0.000000    1.000000    0.170000
25%      0.000000    1.000000   21.000000
50%      0.000000    3.000000   27.000000
75%      1.000000    3.000000   39.000000
max      1.000000    3.000000   76.000000

- Gestion des données manquante

In [33]:
#df = df.fillna(df['Age'].mean) Remplancement des nan par la moyenne
df = df.dropna(axis=0)  # Suppression de la ligne contenant des valeurs manquante